In [1]:
import pandas as pd

In [2]:
pd.options.display.max_columns = None
pd.options.display.expand_frame_repr =False

Read in the clean data using pandas

In [3]:
df = pd.read_csv('../data_clean/clean_yield_data.csv')

Get Name, Location and Price for Diesel cars sort by prices(ascending)

In [4]:
df_Diesel = df.loc[df['Fuel_Type_Diesel'] == True, ['Name', "Location",'Price']].sort_values(by='Price')
df_Diesel.head(5)

                                  Name Location  Price
5819  Tata New Safari DICOR 2.2 VX 4x2     Pune   0.60
1669             Tata Indica V2 DLS TC  Kolkata   0.70
2730               Hyundai Accent CRDi   Mumbai   0.85
221            Tata Indica V2 DLS BSII   Jaipur   0.85
4732                Tata Indica V2 DLX  Kolkata   0.85

Find average Price,Mileage and Power grouped by Year

In [5]:
df_summary = df.groupby('Year').agg(
    Avg_price=('Price', 'mean'),
    Avg_Mileage=('Mileage_kmpl', 'mean'),
    Avg_Power=('Power_bhp', 'mean'),
    Car_Count=('Name', 'count')
).round(3)
df_summary.head(20)

      Avg_price  Avg_Mileage  Avg_Power  Car_Count
Year
1998      1.627       14.867     92.567          3
1999      0.835       15.150     75.000          2
2000      1.175       15.268     60.775          4
2001      0.920       14.440     89.280          5
2002      1.322       15.158     64.592         12
2003      2.549       14.594     84.075         16
2004      1.990       13.744     94.159         27
2005      2.263       14.058    105.291         44
2006      3.596       15.166    109.378         69
2007      3.428       14.845    104.643        106
2008      4.051       15.279    112.224        163
2009      5.246       15.547    122.060        193
2010      5.478       16.331    116.565        330
2011      6.813       16.827    119.996        455
2012      7.461       17.933    112.775        558
2013      8.836       18.311    115.108        631
2014      9.742       18.734    114.375        784
2015     11.317       19.090    113.236        734
2016     11.777       19.608    109.765        734
2017     13.832       19.393    111.978        582

In [6]:
df.head(10)

                                  Name    Location  Year  Kilometers_Driven Owner_Type  Mileage_kmpl  Engine_CC  Power_bhp  Seats  Price  Fuel_Type_Diesel  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Automatic  Transmission_Manual  Car_Age
0     Hyundai Creta 1.6 CRDi SX Option        Pune  2015              41000      First         19.67     1582.0     126.20    5.0  12.50              True               False             False                   False                 True       10
1                         Honda Jazz V     Chennai  2011              46000      First         13.00     1199.0      88.70    5.0   4.50             False               False              True                   False                 True       14
2                    Maruti Ertiga VDI     Chennai  2012              87000      First         20.77     1248.0      88.76    7.0   6.00              True               False             False                   False                 True       13
3      Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013              40670     Second         15.20     1968.0     140.80    5.0  17.74              True               False             False                    True                False       12
4               Nissan Micra Diesel XV      Jaipur  2013              86999      First         23.08     1461.0      63.10    5.0   3.50              True               False             False                   False                 True       12
5    Toyota Innova Crysta 2.8 GX AT 8S      Mumbai  2016              36000      First         11.36     2755.0     171.50    8.0  17.50              True               False             False                    True                False        9
6  Volkswagen Vento Diesel Comfortline        Pune  2013              64430      First         20.54     1598.0     103.60    5.0   5.20              True               False             False                   False                 True       12
7       Tata Indica Vista Quadrajet LS     Chennai  2012              65932     Second         22.30     1248.0      74.00    5.0   1.95              True               False             False                   False                 True       13
8                     Maruti Ciaz Zeta       Kochi  2018              25692      First         21.56     1462.0     103.25    5.0   9.95             False               False              True                   False                 True        7
9          Honda City 1.5 V AT Sunroof     Kolkata  2012              60000      First         16.80     1497.0     116.30    5.0   4.49             False               False              True                    True                False       13